
# 大公司的工作氛围
谈大公司的工作氛围没什么资格，因为那都是道听途说与想象中的氛围。所以只分享看法，可能全是错的，但还是要说一说。
大公司最大的好处，在于已经在行业形成规模，行业的市场已经占领相当的份额。所以，在大公司，会比较有机会接触做大事的人。所谓做大事的人，往往是有较强的改变世界可能的人。**与他们的接触，会有利于打开自己的视野。这是在大公司最大的好处**。  我们并不是去大公司学习做事。事实上，那些所谓在大公司才有机会学到的做事能力，并不难学，并不是没机会学，并不是一定要学。解决问题的方案有很多，能解决问题就行，不需要纠结要用什么样的解法。
大公司的另一个优点是分工明确，一个互联网产品开发团队，只需要做开发，对于业务与产品，理解即可，不需要自己收集与设计。开发完即可交付，测试与维护工作相对较少。不用抬杠，成熟的测试、运维团队，可以省去开发人员不少的精力，这是大公司才会有的。
# 创业小公司的乐趣
所以我不愿意呆在大公司。
我并不是科班出身，专业如此。半路出家，弯道超车的小孩，没有功夫走常规的路线。创业公司的氛围更适合我。
在创业公司三个月，我的职位是后端开发工程师，实际却做着项目立项、需求收集、系统设计、工程实现、产品测试全流程的工作。当然公司团队已经有些沉淀，项目部署上线不需要我花过多的心思，其他的工作也有效仿的项目，并不是完全从零做起。但这事实上满足了我做事情的风格，主导合作而不是合作主导。我需要什么去问什么，而不是别人给我什么我用什么。
这就是创业公司的乐趣。所有事情需要自己来，每一个成员都必须能够独当一面。任何新项目，只能想着做成，做成。不能有丝毫做不成甩锅的想法，这跟在大公司是完全不一样的。
# 选择老牌大公司还是初创小公司
这是一个没有正确答案的选择题。任何做出选择的人，都有着不一样的背景。无论成功与失败（普遍意义的成功，也就是你认为的成功），都不是由当初的选择决定的。即使做了另一个选择，并不一定不会更好。
所以，选择的时候，只需要问自己一个问题，我想要什么。两条路毕竟还是有很多不一样的地方的，有非常多的区隔。如上所述，大公司意味着资源吸收，小公司意味着经验积累。想一想自己想要什么，需要什么，基本就可以做出选择了。很多人并不是不知道选择什么，而是没什么可选。

# 做事情的态度
以前读过胡适谈人生的意义，胡适说，不要只思考着人生有何意义，而是去做一些事情，去主动赋予人生意义，当做了什么，则赋予了人生什么意义。
其实，思考人生意义，是一个无穷无尽的议题。持续深入的想下去，只会掉入一个黑洞，一切都被吸收。思考人生的意义，最后只有一个结果，那就是没有意义。有钱带不走，有快乐也是活着的时候，改变世界如爱因斯坦，也是留给后人享受而自己并没有机会感受。被人记住的除了流芳百世也有遗臭万年。可无论名声好坏，人们并没有真正记住。这个时代的人很容易失忆。
所以，于我而言，做事情的态度，不再是做这件事情有什么意义，只是简单的想去做事，做了这件事了。早起背单词，没什么意义，今天起来或者不起来，并没有什么影响。只是，单纯的想做这么一件事，所以起来了，罢了。
如果一定要赋予它意义，那就是，在这个普遍失忆的年代，做一些不容易忘记的事。
